import React from "react";
import {ScrollView, Text } from "react-native";

const DataProcessing = () => {

    return (


        <ScrollView style={{paddingHorizontal: 16, paddingVertical: 16}}>
            <Text style={{marginBottom: 20, fontSize: 16, fontWeight: "bold"}}>Политика конфиденциальности
                при использовании Мобильного приложения “My Med” ОсОО «Май Мед»</Text>
            <Text>
                1. Введение.
                {`\n`}
                1. Настоящая Политика конфиденциальности (далее - Политика) разработана в
                соответствии с требованиями Закона Кыргызской Республики «Об информации
                персонального характера», а также иным действующим законодательством
                Кыргызской Республики и распространяется на всех посетителей и пользователей
                Мобильного приложения «My Med» (далее – Приложение).
                2. В настоящей Политике используются следующие термины:
                {`\n`}
                <Text style={{fontWeight: 'bold'}}>Администрация Приложения</Text> - уполномоченные сотрудники на управление
                Приложениями, которые организуют и (или) осуществляют обработку
                персональных данных, а также определяют цели обработки персональных данных,
                состав персональных данных, подлежащих обработке, действия (операции),
                совершаемые с персональными данными.
                {`\n`}
                <Text style={{fontWeight: 'bold'}}>Персональные данные</Text> - зафиксированная информация на материальном носителе
                о конкретном человеке, отождествленная с конкретным человеком или которая
                может быть отождествлена с конкретным человеком, позволяющая
                идентифицировать этого человека прямо или косвенно, посредством ссылки на один
                или несколько факторов, специфичных для его биологической, экономической,
                культурной, гражданской или социальной идентичности.
                {`\n`}
                <Text style={{fontWeight: 'bold'}}>Обработка персональных данных</Text> - любая операция или набор операций,
                выполняемых независимо от способов держателем (обладателем) персональных
                данных либо по его поручению, автоматическими средствами или без таковых, в
                целях сбора, записи, хранения, актуализации, группировки, блокирования, стирания
                и разрушения персональных данных
                {`\n`}
                <Text style={{fontWeight: 'bold'}}>Конфиденциальность персональных данных</Text> - нормативно установленные
                правила, определяющие ограничения доступа, передачи, предоставления и условия
                хранения персональных данных.
                {`\n`}
                <Text style={{fontWeight: 'bold'}}>Пользователь Приложения</Text> – лицо, имеющее доступ к Приложению посредством
                сети Интернет или мобильного телефона.
                {`\n`}
                <Text style={{fontWeight: 'bold'}}>2. Общие положения</Text>
                {`\n`}
                3. Принятие условий настоящей Политики, осуществляется путем прохождения
                процесса регистрации/идентификации/верификации Пользователем Приложения и
                является выраженным осознанным согласием Пользователя на обработку
                персональных данных.
                {`\n`}
                4. Использование Пользователем Приложения означает согласие с настоящей
                Политикой и условиями обработки персональных данных Пользователя
                Приложения, в том числе согласие:
                {`\n`}
                4.1. на обработку персональных данных (сбор, запись, хранение, актуализация
                (обновление, изменение), группировка персональных данных);
                {`\n`}
                4.2. на передачу персональных данных третьим лицам в соответствии с Законом
                Кыргызской Республики «Об информации персонального характера» и иными
                нормативными правовыми актами в сфере информации персонального
                характера;
                {`\n`}
                4.3. на передачу персональных данных кредитным бюро в соответствии с Законом
                Кыргызской Республики «Об обмене кредитной информацией» для
                Политика конфиденциальности при использовании Мобильогох приложения “My Med” ОсОО «Май Медк» 2
                последующей обработки (сбора, записи, хранения, актуализации (обновления,
                изменения), группировки персональных данных).
                {`\n`}
                5. В случае несогласия с условиями Политики Пользователь Приложения должен
                прекратить использование Приложения.
                {`\n`}
                <Text style={{fontWeight: 'bold'}}>3. Предмет Политики</Text>
                {`\n`}
                6. Настоящая Политика устанавливает обязательства Администрации Приложения, по
                неразглашению и обеспечению режима защиты конфиденциальности персональных
                данных, которые Пользователь Приложения предоставляет по запросу
                Администрации Приложения, при регистрации в Приложении.
                {`\n`}
                7. Любая иная персональная информация, неоговоренная выше подлежит надежному
                хранению и нераспространению.
                {`\n`}
                8. Персональные данные, разрешённые к обработке в рамках настоящей Политики,
                предоставляются Пользователем Приложения путём авторизации и/или
                прохождения удаленной идентификации для возможности использования
                услуг приложения, и включают в себя следующую
                информацию: тип национального паспорта, ИНН, ФИО, дата рождения, номер
                документа, наименование органа, выдавшего документ и его код, дата выдачи,
                гражданство, пол, адрес фактического проживания, номер
                телефона и адрес электронной почты.
                {`\n`}
                <Text style={{fontWeight: 'bold'}}>4. Цели сбора персональной информации Пользователя Приложения</Text>
                {`\n`}
                9. Идентификация Пользователя, зарегистрированного в Приложении, для его
                дальнейшей авторизации, присоединения к условиям Публичной оферты и
                предоставления услуг приложения;
                {`\n`}
                10. Подтверждение достоверности и полноты персональных данных, предоставленных
                Пользователем Приложения;
                {`\n`}
                11. Создание учетной записи в Приложении;
                {`\n`}
                12. Предоставление Пользователю Приложения эффективной клиентской и
                технической поддержки при возникновении проблем, связанных с использованием
                Приложения;
                {`\n`}
                13. Установления с Пользователем обратной связи, включая направление уведомлений,
                запросов, касающихся использования Приложения, оказания услуг и обработки
                запросов и заявок от Пользователя;
                {`\n`}
                14. Определения места нахождения Пользователя для обеспечения дополнительного
                удобства, безопасности, предотвращения мошенничества;
                {`\n`}
                15. Информирование о проводимых акциях и специальных предложениях;
                {`\n`}
                16. Осуществление рекламной деятельности Администрацией Приложения;
                {`\n`}
                17. и иных необходимых целях, связанных с деятельностью Приложения.
                {`\n`}
                <Text style={{fontWeight: 'bold'}}>5. Способы и сроки обработки персональной информации</Text>
                {`\n`}
                18. Обработка персональных данных Пользователя Приложения осуществляется без
                ограничения срока, любым законным способом, в том числе в информационных
                системах персональных данных с использованием средств автоматизации или без
                использования таких средств.
                {`\n`}
                19. Пользователь Приложения соглашается с тем, что Администрация Приложения
                вправе передавать персональные данные третьим лицам, в целях оказания
                Пользователю Приложения качественных услуг.
                Политика конфиденциальности при использовании Мобильного приложения “My Med” ОсОО «Май Мед» 3
                {`\n`}
                20. Персональные данные Пользователя Приложения могут быть переданы
                уполномоченным органам государственной власти Кыргызской Республики только
                по основаниям и в порядке, установленным законодательством Кыргызской
                Республики.
                {`\n`}
                21. Администрация Приложения, принимает необходимые организационные и
                технические меры для защиты персональной информации Пользователя
                Приложения от неправомерного или случайного доступа, уничтожения, изменения,
                блокирования, копирования, распространения, а также от иных неправомерных
                действий третьих лиц.
                {`\n`}
                <Text style={{fontWeight: 'bold'}}>6. Права и обязанности Сторон</Text>
                {`\n`}
                22. Пользователь Приложения обязан:
                {`\n`}
                22.1. Предоставлять и обновлять информацию о персональных данных,
                необходимую для пользования Приложением.
                {`\n`}
                22.2. Изменять и дополнять предоставленную информацию в случае обнаружения
                некорректных данных при использовании Приложения.
                {`\n`}
                23. Пользователь Приложения вправе:
                {`\n`}
                23.1. На доступ и редактирование информации о персональных данных в любое
                время через Приложение и/или через офисы Банка.
                {`\n`}
                24. Администрация Приложения обязана:
                {`\n`}
                24.1. Использовать полученную информацию исключительно для целей, указанных
                в Разделе 4 настоящей Политики.
                {`\n`}
                24.2. Обеспечить хранение конфиденциальной информации в тайне, не разглашать
                без предварительного письменного разрешения Пользователя Приложения, а
                также не осуществлять продажу, обмен, опубликование, либо разглашение
                иными возможными способами переданных персональных данных
                Пользователя сайта.
                {`\n`}
                25. Администрация Приложения имеет право:
                {`\n`}
                25.1. Предоставлять доступ для сбора и анализа данных Пользователей Приложения
                третьим лицам для целей статистики и оптимизации рекламных сообщений.
                Использование неличных данных третьими лицами регулируется их
                собственными политиками конфиденциальности, и Администрация
                Приложения не несет ответственности за их использование.
                {`\n`}
                25.2. Пользователь Приложения соглашается с тем, что Администрация
                {`\n`}
                Приложения вправе передавать персональные данные третьим лицам,
                исключительно в целях предоставления услуг приложения.
                {`\n`}
                25.3. Персональные данные Пользователя Приложения могут быть переданы
                уполномоченным органам государственной власти Кыргызской Республики
                только по основаниям и в порядке, установленным законодательством
                Кыргызской Республики.
                {`\n`}
                <Text style={{fontWeight: 'bold'}}>7. Ответственность сторон</Text>
                {`\n`}
                26. В случае утраты или разглашения Конфиденциальной информации Администрация
                Приложения не несёт ответственность, если данная конфиденциальная
                {`\n`}
                26.1. Стала публичным достоянием до её утраты или разглашения.
                {`\n`}
                26.2. Была получена от третьей стороны до момента её получения Администрацией
                Приложения.
                {`\n`}
                26.3. Была разглашена с согласия Пользователя Приложения.
                Политика конфиденциальности при использовании Мобильного приложения “My Med” ОсОО «Май Мед»
                {`\n`}
                <Text style={{fontWeight: 'bold'}}>8. Разрешение споров</Text>
                {`\n`}
                27. До обращения в суд с иском по спорам, возникающим из отношений между
                Пользователем Приложения, и Администрацией Приложения, обязательным
                является предъявление претензии (письменного предложения о добровольном
                урегулировании спора).
                {`\n`}
                28. Получатель претензии в течение 30 календарных дней со дня получения претензии,
                письменно уведомляет заявителя претензии о результатах рассмотрения претензии.
                {`\n`}
                29. При не достижении соглашения спор будет передан на рассмотрение в судебный
                орган в соответствии с действующим законодательством Кыргызской Республики.
                {`\n`}
                30. К настоящей Политике и отношениям между Пользователем Приложения и
                Администрацией Приложения, применяется действующее законодательство
                Кыргызской Республики.
                {`\n`}
                <Text style={{fontWeight: 'bold'}}>9. Дополнительные условия</Text>
                {`\n`}
                31. Администрация Приложения вправе вносить изменения в настоящую Политику без
                согласия Пользователя Приложения.
                {`\n`}
                32. Настоящая Политика вступает в силу со дня утверждения уполномоченным органом
                ОсОО «Май Мед», если иное не установлено в решении уполномоченного органа ОсОО
                «Май Мед» .
                {`\n`}
                33. Если в результате изменения действующего законодательства Кыргызской
                Республики отдельные пункты настоящей Политики вступают в противоречие с
                ними, применяются нормы законодательства Кыргызской Республики, до внесения
                соответствующих изменений в настоящую Политику.
                {`\n`}
                34. Вопросы, прямо не урегулированные настоящей Политикой, регламентируются
                соответствующими внутренними нормативными документами ОсОО «Май Мед» и
                действующим законодательством Кыргызской Республики.
            </Text>
        </ScrollView>

    )
}

export default DataProcessing
