import React from "react";
import {ScrollView, Text} from "react-native";

const UserAgreement = () => {
    return (
      <ScrollView style={{paddingHorizontal: 16, paddingVertical: 16}}>
          <Text style={{textAlign: 'center', marginBottom: 20, fontSize: 16}}> Пользовательское соглашение.</Text>
            <Text>
                Настоящий документ «Пользовательское соглашение» на использование Мобильного
                приложения «My Med» (далее - Мобильное приложение) является предложением
                Общества с
                ограниченной ответственностью «Май Мед»,  РН 201513-3310-ООО; ИНН
                00212202110096,
                (далее по тексту — «Правообладатель») заключить настоящее Соглашение на изложенных
                ниже условиях.
                {`\n \n`}
                <Text style={{fontWeight: 'bold'}}>
                    ВАЖНО: перед использованием Мобильного приложения, пожалуйста, ознакомьтесь
                    с условиями настоящего Пользовательского соглашения.
                </Text>
                {`\n \n`}

                <Text style={{fontWeight: 'bold'}}>Общие положения</Text>
                {`\n`}
                1.1. Пользуясь Мобильным приложением, Вы соглашаетесь с тем, что:
                1.1.1. Вы ознакомились с условиями настоящего Пользовательского соглашения
                в полном объёме до начала использования Мобильного приложения.
                1.1.2. Начало использования Вами Мобильного приложения в любой форме
                означает, что Вы принимаете все условия настоящего Пользовательского
                соглашения в полном объёме без каких-либо изъятий и ограничений с Вашей
                стороны. Использование Мобильного приложения на иных условиях
                не допускается.
                1.1.3. Если Вы не согласны с условиями настоящего Пользовательского
                соглашения или не имеете права на его заключение, Вам следует
                незамедлительно прекратить любое использование Мобильного приложения.
                1.1.4. Пользовательское соглашение (в том числе любая из его частей) может
                быть изменено Правообладателем без какого-либо специального уведомления и
                без выплаты какой-либо компенсации в связи с этим. Новая редакция
                Соглашения и/или указанных в нем обязательных документов вступает в силу с
                момента ее размещения в Мобильном приложении, если иное не предусмотрено
                новой редакцией Соглашения, и Пользователь обязуется самостоятельно
                регулярно отслеживать изменения в Соглашении. Продолжение использования
                Пользователем Мобильного приложения после размещения изменений в
                настоящее Соглашение будет означать согласие Пользователя с этими
                изменениями.
                1.2. Настоящее Пользовательское соглашение, порядок его заключения и исполнения, а
                также вопросы, не урегулированные настоящим соглашением, регулируются
                действующим законодательством Кыргызской Республики. Все споры по настоящему
                соглашению или в связи с ним подлежат рассмотрению в суде по месту нахождения
                Правообладателя в соответствии с действующим правом Кыргызской Республики.
                {`\n`}
                <Text style={{fontWeight: 'bold'}}>2. Термины и определения</Text>
                {`\n`}
                2.1. В настоящем Соглашении слова и выражения имеют следующие значения, если
                иное прямо не определено далее по тексту:
                2.1.1.  Контент— изображения, аудио- и видеоматериалы, а также сообщения
                любого характера, содержащиеся в Мобильном приложении.
                2.1.2.  Правообладатель— общество с ограниченной ответственностью
                «Май Мед», РН 201513-3310-ООО; ИНН 00212202110096;
                2.1.3.  Пользователь  — дееспособное физическое лицо, присоединившееся к
                настоящему Пользовательскому соглашению в собственном интересе либо
                выступающее от имени и в интересах представляемого им лица.
                2.1.4.  Пользовательское соглашение— настоящее соглашение между
                Пользователем и Правообладателем, устанавливающее правила пользования
                Мобильным приложением.
                2.1.5.  Мобильное приложение— принадлежащая Правообладателю программа
                для онлайн покупок «My Med», содержащая пошаговые инструкции по настройке и
                эксплуатации бытовой техники с использованием технологии дополненной
                реальности.
                2.1.6.  Коммерческое использование— использование, выходящее за рамки
                разрешённого по настоящему соглашению функционального применения и/или
                предоставленных прав на использование фрагментов Мобильного приложения,
                а также иных объектов интеллектуальной собственности, физическим лицом —
                с целью получения дохода (прибыли), а индивидуальным предпринимателем
                или организацией — в целях извлечения предпринимательской выгоды, в том
                числе их предоставление или обеспечение к ним доступа на возмездной основе,
                т.е. за плату или любое встречное предоставление товаров, работ, услуг, либо с
                одновременным предоставлением товаров, работ, услуг на возмездной основе в
                том или ином виде. Коммерческое использование Мобильного приложения, а
                также иных объектов интеллектуальной собственности, принадлежащих
                Правообладателю, либо находящихся в его пользовании, может быть разрешено
                Правообладателем только основании отдельного соглашения с Пользователем.
                2.2. В настоящем Пользовательском соглашении, а также документах, вытекающих или
                связанных с ним, могут быть использованы иные термины и определения, не указанные
                в п. 2.1. настоящего соглашения. В этом случае толкование такого термина
                производится в соответствии с текстом настоящего соглашения. В случае отсутствия
                однозначного толкования термина или определения в тексте настоящего соглашения, а
                также документах, вытекающих или связанных с ним (если иное прямо не
                предусмотрено), следует руководствоваться его толкованием, определённым, в первую
                очередь, законодательством Кыргызской Республикии, во вторую очередь, обычаями
                делового оборота и научной доктриной.
                {`\n`}
                <Text style={{fontWeight: 'bold'}}>3. Исключительные права</Text>
                {`\n`}
                3.1. Мобильное приложение в целом и включаемые в его состав или используемые
                совместно с ними программы для онлайн покупок, базы данных и прочие текстовые материалы,
                изображения и иные объекты авторских и/или смежных прав, а равно объекты
                патентных прав, товарные знаки, коммерческие обозначения и фирменные
                наименования, а также иные части Мобильного приложения (независимо от того,
                входят ли они в его состав или являются дополнительными компонентами,
                и возможно ли их извлечение из их состава и использование самостоятельно)
                в отдельности (далее — «Объекты интеллектуальной собственности») защищены
                в соответствие с Частью II Гражданского кодекса Кыргызской Республики
                и принадлежат Правообладателю на исключительном праве, если иное не указано
                в уведомлении о правах и иных соглашениях.
                3.2. Права и способы использования Мобильного приложения, в явном виде не
                предоставленные/не разрешённые Пользователю по настоящему Пользовательскому
                соглашению, считаются не предоставленными/запрещёнными Правообладателем.
                3.3. Мобильное приложение может содержать информацию о сайтах (мобильных
                приложениях) третьих лиц. Переход на любой другой интернет-ресурс, связанный с
                данным Мобильным приложением, осуществляется на страх и риск Пользователя;
                Правообладатель не несёт ответственности за точность информации, данных, взглядов,
                советов или заявлений, указанных (размещённых) на этих сайтах. Правообладатель
                обеспечивает ссылки на другие сайты исключительно для удобства Пользователя, и это
                не означает, что Пользователь одобряет содержание данных сайтов или несёт за него
                какую-либо ответственность.
                {`\n`}
                <Text style={{fontWeight: 'bold'}}>4. Лицензионные условия</Text>
                {`\n`}
                4.1. Использование Мобильного приложения разрешается строго на условиях,
                установленных настоящим Пользовательским соглашением. Если Пользователь
                не принимает условия Пользовательского соглашения в полном объёме, он не имеет
                права использовать Мобильное приложение в каких-либо целях. Использование
                мобильного приложения с нарушением (невыполнением) какого-либо из условий
                Пользовательского соглашения запрещено.
                4.2. Правообладатель предоставляет Пользователю право использования Мобильного
                приложения на условиях простой (неисключительной) непередаваемой лицензии на
                территории всех стран мира указанными в настоящем разделе способами:
                4.2.1. Функциональное использование Мобильного приложения
                Пользователь вправе применять Мобильное приложение по его прямому
                функциональному назначению и с этой целью произвести их установку
                на настольных или карманных персональных компьютерах, смартфонах
                или других устройствах (далее — «Устройства»).
                В соответствие с настоящим пунктом, Пользователь вправе произвести
                установку Мобильного приложения на неограниченное число
                Устройств, а также хранить или устанавливать копии Мобильного
                приложения на устройстве хранения данных (например, на сервере
                сети), предназначенном и используемом исключительно для установки
                и работы Мобильного приложения на других Устройствах.
                Пользователь вправе использовать Мобильное приложения по прямому
                функциональному назначению на неограниченном числе Устройств
                в соответствии с условиями настоящего Пользовательского соглашения.
                Пользователь вправе, используя Мобильное приложение по его
                прямому функциональному назначению, создавать и использовать без
                каких-либо ограничений изображения, аудио- и видеоматериалы, а
                также сообщения.
                4.2.2. Воспроизведение Мобильного приложения
                Пользователь вправе воспроизводить Мобильное приложение,
                экземпляры которого распространяются Правообладателем,
                в некоммерческих целях на безвозмездной основе на любых
                Устройствах и прочих видах материальных носителей при условии
                сохранения в неизменном виде комбинации, состава и содержания
                Мобильного приложения по сравнению с тем, как они предоставляются
                и рекомендуются для использования Правообладателем.
                4.2.3. Распространение Мобильного приложения
                Пользователь вправе распространять Мобильное приложение
                посредством передачи его экземпляров, воспроизведённых
                в соответствие с пунктом 4.2.2 настоящего Соглашения,
                в некоммерческих целях на безвозмездной основе и при соблюдении
                их целостности, если иное не предусмотрено письменным разрешением
                Правообладателя.
                4.3. Пользователю разрешается использовать Мобильное приложение на безвозмездной
                основе на условиях настоящего Пользовательского соглашения исключительно в
                личных некоммерческих целях. Ввиду предоставления в рамках настоящего
                Пользовательского соглашения права использования Мобильного приложения в
                некоммерческих целях на безвозмездной основе к отношениям сторон по настоящему
                Пользовательскому соглашению неприменимы положения законодательства о защите
                прав потребителей.
                {`\n`}
                <Text style={{fontWeight: 'bold'}}> 5. Особые условия</Text>
                {`\n`}
                5.1. Выполнение некоторых функций Мобильного приложения возможно только при
                наличии доступа к интернету. Пользователь самостоятельно получает и оплачивает
                такой доступ на условиях и по тарифам своего оператора связи или провайдера доступа
                к интернету.
                Правообладатель не несёт ответственности за содержание и/или актуальность
                информации на  сайтах (в мобильных приложениях) , предоставляемой партнёрами.
                5.2. Пользователь настоящим уведомлён и соглашается, что Мобильное приложение с
                помощью сервисов интернет-статистики собирает статистические данные об использовании
                Мобильного приложения, и в автоматическом режиме передает их Правообладателю.
                Правообладатель использует полученные статистические данные для сбора информации о
                действиях пользователя в Мобильном
                приложении и улучшения качества Мобильного приложения. От Пользователя
                требуется предоставление персональных данных для использования Мобильного
                приложения.
                5.3. Правообладатель оставляет за собой право в одностороннем порядке изменять
                Мобильное приложение (либо его часть), производить обновления в любое время без
                предварительного уведомления Пользователя.
                5.4. Настоящее Пользовательское соглашение и все отношения, связанные с
                использованием Мобильного приложения, регулируются законодательством
                Российской Федерации.
                5.5. Мобильное приложение может взаимодействовать со специальными
                программно-аппаратными средствами для проверки наличия обновлений для
                Мобильного приложения, как то модификаций Мобильного приложения,
                дополнительных модулей к нему, а также обновлений баз данных (далее
                «Обновления»).
                5.6. Устанавливая Мобильное приложение, Пользователь соглашается на возможность
                осуществления Мобильным приложением запросов, а также получение и установку
                Обновлений в автоматическом режиме.
                5.7. Настоящее соглашение может быть изменено или прекращено Правообладателем
                в одностороннем порядке без предварительного уведомления Пользователя и без
                выплаты какой-либо компенсации в связи с этим.
                {`\n`}
                <Text style={{fontWeight: 'bold'}}>6. Ограничения использования</Text>
                {`\n`}
                6.1. Пользователь не имеет права самостоятельно или с привлечением третьих лиц:
                6.1.1. Вскрывать технологию, эмулировать, создавать новые версии, изменять,
                декомпилировать, дизассемблировать, дешифровать и производить с
                Мобильным приложением иные действия, имеющие целью нарушение системы
                защиты Мобильного приложения от несанкционированного использования,а
                также получение информации о реализации алгоритмов, используемых в
                Мобильном приложении;
                6.1.2. Удалять или любым способом изменять товарные знаки, промышленные
                образцы и уведомления об авторских и любых иных правах, включённые в
                Мобильное приложение;
                6.1.3. Использовать Мобильное приложение (либо его любые части) в
                политических, общественных и религиозных целях без письменного согласия
                Правообладателя;
                6.1.4. Использовать Мобильное приложение (либо его любые части) в
                Коммерческих целях без письменного согласия Правообладателя.
                6.2. Во избежание сомнений, Пользователю запрещается извлекать и использовать в
                любой форме и любым способом аудио- и видеоматериалы, сообщения любого
                характера, текстовые материалы, изображения и иные объекты авторских и/или
                смежных прав, а равно объекты патентных прав, товарные знаки, коммерческие
                обозначения и фирменные наименования, содержащиеся в Мобильном приложении и
                являющиеся его частью, а также иные части и программы для онлайн покупок или базы данных,
                входящие в его состав или используемые совместно с ним (независимо от того,
                входят ли они в состав Мобильного приложения или являются его дополнительными
                компонентами, и возможно ли их извлечение из их состава и использование
                самостоятельно).
                {`\n`}
                <Text style={{fontWeight: 'bold'}}>7. Ответственность</Text>
                {`\n`}
                7.1 Пользователь в полной мере осознаёт и подтверждает следующее:
                7.1.1. Пользователь использует Мобильное приложение полностью на свой
                риск. Мобильное приложение предоставляется  «как есть» и «то,
                что есть» . Правообладатель особо подчёркивает отсутствие каких-либо
                гарантий, как выраженных, так и невыраженных, включая, помимо прочего,
                гарантии качества Мобильного приложения, пригодности его для той или иной
                цели.
                7.1.2. Правообладатель не гарантирует, что:
                а) Мобильное приложение будет отвечать требованиям пользователя;
                б) Мобильное приложение будет поставляться бесперебойно, вовремя,
                безошибочно и безопасно;
                в) результаты, полученные в результате использования Мобильного
                приложения, будут достоверными или надёжными;
                г) любые ошибки в программном обеспечении будут исправляться.
                7.1.3. Загрузка и получение другим способом любого Контента в ходе
                использования Мобильного приложения совершается на страх и риск
                пользователя, который несёт полную ответственность за любые повреждения
                его мобильного устройства, потерю данных и иные последствия, в том числе
                повреждения техники при использовании инструкций, содержащихся в
                Мобильном приложении.
                7.1.4. Никакие рекомендации или сведения, полученные пользователем устно
                или письменно от правообладателя или посредством Мобильного приложения,
                не накладывают на Правообладателя гарантий, отличных от тех, что оговорены
                в условиях настоящего соглашения.
                7.1.5. Правообладатель не несёт ответственности за любой прямой, косвенный,
                случайный, специальный, вытекающий или наложенный как наказание ущерб,
                включая, помимо прочего, упущенную выгоду, ущерб от использования,
                потерю данных или какие-либо другие материальные/нематериальные потери,
                ущерб репутации и иной ущерб (даже если правообладатель был уведомлён о
                возможности такого ущерба), возникающий вследствие:
                а) использования или невозможности использования Мобильного
                приложения;
                б) изменения условий соглашения, получения данных взамен
                обретённых через Мобильное приложение или посредством
                Мобильного приложения, или в результате заключённых сделок,
                сообщений и информации, полученных от Мобильного приложения или
                посредством Мобильного приложения;
                в) неуполномоченного доступа к данным пользователя или изменения
                передаваемых им или хранящихся на сервере данных;
                г) заявлений или поведения любого лица в Мобильном приложении;
                д) любого другого случая, имеющего отношение к предоставляемому
                сервису.
                {`\n`}
                <Text style={{fontWeight: 'bold'}}>8. Прочая информация </Text>
                {`\n`}
                8.1. Материалы, содержащиеся в Мобильном приложении, являются охраняемыми
                авторским правом. Законы об авторских правах запрещают копирование,
                воспроизведение, использование и распространение данных, логотипов, графических
                изображений, иллюстраций, дизайна продукта и связанных с ним документов
                (руководств, официальных документов, таблиц и т.д.) в целом или частично без
                разрешения правообладателя. Законы об авторских правах запрещают использование,
                копирование, сдачу в аренду, изменение и распространение программного обеспечения
                полностью или частично без разрешения правообладателя.
                8.2. Все логотипы, использованные в Мобильном приложении, являются товарными
                знаками и охраняемой авторским правом собственностью их правообладателей.
                Включённые в Мобильное приложение тексты, графика, изображения и обозначения
                продуктов являются собственностью соответствующих авторов (правообладателей)
                данных элементов.
                8.3. Использование Мобильного приложения на условиях соответствующих
                лицензионных соглашений не означает передачу Пользователю никаких
                имущественных или неимущественных прав на использование компонентов
                Мобильного приложения.
                </Text>
      </ScrollView>

    )
}

export default UserAgreement
